电脑/计算机理论/企业应用架构模式读书笔记.org
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:[11pt,oneside]
#+LATEX_HEADER: \usepackage{article}


#+TITLE: 企业应用架构模式读书笔记
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@gmail.com">a358003542@gmail.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com


软件的分层: 
1. 表现层 提供服务，显示信息，处理用户请求，命令行调用，批处理API
2. 领域层 逻辑，系统中真正的核心
3. 数据源层 与数据库、消息系统、事务管理器及其他软件包通信

最核心的一个原则: 领域层和数据源层不应该依赖于表现层。

领域模型风格只有在领域逻辑复杂到一定程度的时候才有优势，而对于业务逻辑更加碎片话的后端来说，大部分时候处理的任务逻辑复杂度最多只能算得上中等，实现良好的表模块风格就能够很好的满足需要了，而且其所需要的额外的工作量最少。[参考企业应用架构模式图2-4]

1. 查询操作尽可能牵涉较少的数据库，最好所有的查询信息入口都汇总为一个 数据库视图。
2. 更改编辑操作尽可能集中在某几个数据库表格上，最后所有的更新编辑操作信息出口都汇总为一个 数据库视图。
3. 上面的查询和编辑操作甚至可能合并为一个数据库视图，并且对该数据库视图某个字段数据的修改也会相应的修改，但视图对此支持功能还是很有限的，insert操作应该不能很好的支持，所以最好还是只是将视图作为查询入口。

* 参考资料
企业应用架构模式 Martin Fowler 


